Show / Hide Table of Contents
Enum WeldingTypeSNIP
Welding Type
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum WeldingTypeSNIP
Fields
 Name |  Description
 Automatic
Automatic welding
 AutomaticAndMachine
Automatic and machine welding
 Manual
Manual welding
 ManualSmallRodDiam
Manual welding using rod solid cross-section with diameter less than 1.4mm
 Improve this Doc
 View Source